Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: We're all done! Let's check if everything's working.
ja_jp: 全て終わりました！正常に動作しているか確認してみましょう。

source: We're done! So, let's see if it works.
ja_jp: できました！では、実際に動くかどうか見てみましょう。

source: We're pleased to announce the release of Quarkus 3.32.
ja_jp: Quarkus 3.32 のリリースをお知らせいたします。

source: We're providing a few things here:
ja_jp: ここでは、いくつかのことを提供しています。

source: We're ready to go to the next phase: configuring the release.
ja_jp: これで、次の段階であるリリースの設定に進むことができます。

source: We're using Asciidoc region tags to exclude a method from the listing (that we will be adding later).
ja_jp: Asciidoc リージョンタグを使用して、リストからメソッドを除外しています (これは後で追加します)。

source: We're using common text that describes how to start dev mode.
ja_jp: 開発モードを開始する方法を説明する共通テキストを使用しています。

source: We're using public fields here, because it's shorter and there is no expectation of encapsulation on what is essentially a data class.
ja_jp: ここではパブリックフィールドを使用しています。 なぜなら、より短く、本質的にデータクラスであるものに対してカプセル化が期待されていないからです。

source: We're using the AsciiDoc region tag to include only one region of the target file.
ja_jp: AsciiDoc リージョンタグを使用して、ターゲットファイルのリージョンを 1 つだけ含めています。

source: We're using the asciidoc region tag to include only one region of the target file.
ja_jp: asciidoc リージョンタグを使用して、ターゲットファイルのリージョンを 1 つだけ含めています。

source: We've added basic validation support for `@Bulkhead`, `@Timeout`, `@Asynchronous`, and `@Scheduled` annotations.
ja_jp: `@Bulkhead`, `@Timeout`, `@Asynchronous`, `@Scheduled` のアノテーションの基本的な検証をサポートするようになりました。

source: We've addressed various critical issues in our custom Language Server client (LSP4IJ), that previously caused Language Servers to freeze IntelliJ IDEA. Improvements include:
ja_jp: カスタムLanguage Serverクライアント(LSP4IJ)の様々な重大な問題に対処しました。改善点は以下のとおりです：

source: We've also included the list of the newest found online stories. Give it a read and if you feel something is missing or have an article coming out for future Quarkus Newsletter install the https://github.com/quarkusio/url2quarkuspub[bookmarklet] on your laptop and phone to easily submit a story. If you prefer the manual way please https://github.com/quarkusio/quarkusio.github.io/issues[open an issue] with a short description and a url.
ja_jp: また、最新のオンラインストーリーのリストも掲載されています。読んでみて、何か足りないと感じたり、今後のQuarkus Newsletterに掲載予定の記事がある場合は、ノートパソコンや携帯電話に link:https://github.com/quarkusio/url2quarkuspub[ブックマークレット]をインストールすると、簡単に記事を投稿することができます。手動での投稿をご希望の場合は、簡単な説明とURLを入力して link:https://github.com/quarkusio/quarkusio.github.io/issues[Issue]をオープンしてください。

source: We've been focusing on performance improvements, Quarkus 3.x with JakartaEE namespace support, Qute templating support, and generally trying to keep Quarkus Tools out of your way. So let's look in more details at what was accomplished.
ja_jp: パフォーマンスの改善、Quarkus 3.xのJakartaEEネームスペースのサポート、Quteテンプレートのサポート、そして一般的にQuarkus Toolsを邪魔しないようにすることに注力してきました。では、何が達成されたのかを詳しく見ていきましょう。

source: We've described the benefits of Project Leyden in theory, but how does it perform in practice?
ja_jp: Project Leyden の利点は理論上説明しましたが、実際にはどのように機能するのでしょうか？

source: We've eliminated our dependency on Jackson and established protocol buffers (protobuf) as the authoritative source for our domain model. The architecture is straightforward:
ja_jp: Jacksonへの依存を排除し、プロトコルバッファ (protobuf) をドメインモデルの信頼できる唯一の情報源として確立しました。アーキテクチャは次のとおりです。

source: We've implemented full support for push notifications as specified in the A2A 1.0 specification. This allows agents to receive notifications about task updates without polling.
ja_jp: A2A 1.0 仕様で規定されているプッシュ通知を完全にサポートしました。これにより、エージェントはポーリングを行うことなくタスクの更新通知を受け取ることができます。

source: We've introduced Maven BOMs to simplify dependency management:
ja_jp: 依存関係管理を簡素化するためにMaven BOMを導入しました。

source: We've introduced quick fixes that allow you to disable validation for certain errors. Useful, for instance, when you find false-positive errors add too much noise to your development workflow.
ja_jp: 特定のエラーに対する検証を無効にするクイックフィックスを導入しました。例えば、偽陽性のエラーによって開発ワークフローにノイズが多すぎる場合に便利です。

source: We've only just started exploring the possibilities of Neo4j for this use case, and so we still have to learn all the tips and tricks to make the most out of it. As we learn more we'll share any tips or query templates with the community.
ja_jp: 私たちは、このユースケースのためにNeo4jの可能性を探り始めたばかりなので、それを最大限に活用するためのヒントやトリックをすべて学ばなければなりません。より多くのことが分かったら、ヒントやクエリ・テンプレートをコミュニティで共有します。

source: We've reached the point where we can configure the binary distributions. If you run the `./mvnw -Prelease jreleaser:config` command you'll notice there's no mention of any distribution files that we configured in previous steps. This is because the tool has no implicit knowledge of them, we must tell JReleaser which files we'd like to release. This decouples creation of distributions from release assets as you might like to add or remove files at your leisure. For this particular case we'll configure Zip files for both macOS and Windows, and a Tar file for Linux. These files must be added to the JReleaser plugin configuration section, like so:
ja_jp: バイナリー配布を設定できるようになりました。 `./mvnw -Prelease jreleaser:config` コマンドを実行すると、前の手順で設定した配布ファイルについての言及がないことに気付くでしょう。これは、ツールに暗黙の知識がないため、リリースするファイルを JReleaser に通知する必要があるためです。これにより、ファイルを自由に追加または削除したい場合に、ディストリビューションの作成がリリースアセットから切り離されます。この特定のケースでは、macOS と Windows の両方に Zip ファイルを設定し、Linux に Tar ファイルを設定します。これらのファイルは、次のように JReleaser プラグイン設定セクションに追加する必要があります。

source: We've refreshed the look'n'feel with more contrast on pages for better readability.
ja_jp: 見た目を一新し、ページのコントラストを高めて読みやすさを向上させました。

source: We've shared some of our findings and recipes, but I'm sure there are others that are specific to each library and framework. Now is a great time to look at your own startup profiles and see if you can spot some low-hanging fruit to boost performance. And with Quarkus 3.32 and our new AOT integration coming soon, this is going to be easier than ever.
ja_jp: 私たちの発見やレシピのいくつかを共有しましたが、各ライブラリーやフレームワークに固有のものは他にもあるはずです。今こそ自分たちの起動プロファイルを確認し、パフォーマンスを向上させるための「低いところにある果実 (簡単に改善できる点)」を見つける絶好の機会です。Quarkus 3.32 と新しい AOT 統合がまもなく登場すれば、これはかつてないほど容易になるでしょう。

source: We've spent significant effort on making the best Qute support around.
ja_jp: 我々は、最高のQuteサポートを提供するために多大な努力を払ってきた。

source: We've tried to bind some Microprofile and Qute diagnostics reported by the language servers to IntelliJ's Inspections settings, as it felt more natural than having specialized preference pages. But, since this is a bit of a hack, the inspections settings are mostly ignored, except for a couple severity settings. The limitations are described in each inspection description:
ja_jp: 言語サーバーから報告されるMicroprofileとQuteの診断のいくつかを、IntelliJの検査設定にバインドしようとしました。しかし、これはちょっとしたハックなので、いくつかの重大度設定を除いて、検査設定はほとんど無視されます。制限事項については、各検査の説明に記載されています：

source: Weak value production
ja_jp: 弱い値の生成

source: Web
ja_jp: ウェブ

source: Web Client
ja_jp: ウェブクライアント

source: Web Links support
ja_jp: Web リンクのサポート

source: Web component page
ja_jp: Web コンポーネントページ

source: Web dependency locator
ja_jp: Web 依存関係ロケーター

source: WebAuthn JavaScript library
ja_jp: WebAuthn JavaScript ライブラリ

source: WebAuthn authentication
ja_jp: WebAuthn 認証

source: WebAuthn authentication mechanism
ja_jp: WebAuthn 認証メカニズム

source: WebAuthn endpoints
ja_jp: WebAuthnのエンドポイント

source: WebAuthn extension
ja_jp: WebAuthn エクステンション

source: WebAuthn relies on a combination of usernames (unique per user) and credential IDs (unique per authenticator device).
ja_jp: WebAuthnは、ユーザー名（ユーザーごとにユニーク）とクレデンシャルID（認証デバイスごとにユニーク）の組み合わせに依存します。

source: WebAuthn replaces the password with a proof of identity. In practice, users, instead of having to invent a password, store it or remember it, will use a hardware token that will generate a proof of identity specifically for your service or website. This can be done by asking users to press their thumb on their phone, or pressing a button on a https://www.yubico.com[YubiKey] on a computer.
ja_jp: WebAuthnは、パスワードをID証明に置き換えます。実際には、ユーザーは、パスワードを考案したり、保存したり、記憶したりする代わりに、あなたのサービスやウェブサイトのために特別にID証明を生成するハードウェアトークンを使用することになります。これは、ユーザーに携帯電話で親指を押してもらったり、パソコンで link:https://www.yubico.com[YubiKey] のボタンを押したりすることで実現可能です。

source: WebJar Locator Support
ja_jp: WebJar ロケーターのサポート

source: WebSocket Clients
ja_jp: WebSocketクライアント

source: WebSocket Next supports _blocking_ and _non-blocking_ logic, akin to Quarkus REST, determined from the return type of the method and additional annotations such as `@Blocking` and `@NonBlocking`.
ja_jp: WebSocket Next は、Quarkus REST に似た、メソッドの戻り値のタイプと `@Blocking` や `@NonBlocking` などの追加のアノテーションで決定される、_ブロッキング_ と _ノンブロッキング_ ロジックをサポートします。

source: WebSocket client application have to send a new access token before previous one expires:
ja_jp: WebSocket クライアントアプリケーションは、以前のアクセストークンが期限切れになる前に、新しいアクセストークンを送信する必要があります。

source: WebSocket client connection
ja_jp: WebSocket クライアント接続

source: WebSocket connection
ja_jp: WebSocket 接続

source: WebSocket endpoint callback methods can be secured with security annotations such as `io.quarkus.security.Authenticated`, `jakarta.annotation.security.RolesAllowed` and other annotations listed in the xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[Supported security annotations] documentation.
ja_jp: WebSocket エンドポイントのコールバックメソッドは、 `io.quarkus.security.Authenticated` や `jakarta.annotation.security.RolesAllowed` などのセキュリティーアノテーション、および xref:security-authorize-web-endpoints-reference.adoc#standard-security-annotations[サポート対象セキュリティーアノテーション] ドキュメントに記載されているその他のアノテーションを使用して保護できます。

source: WebSocket endpoints can also be notified when an error occurs. A WebSocket endpoint method annotated with `@io.quarkus.websockets.next.OnError` is invoked when an endpoint callback throws a runtime error, or when a conversion errors occurs, or when a returned `io.smallrye.mutiny.Uni`/`io.smallrye.mutiny.Multi` receives a failure.
ja_jp: エラーが発生したときに WebSocket エンドポイントに通知することもできます。 `@io.quarkus.websockets.next.OnError` アノテーションが付与された WebSocket エンドポイントメソッドは、エンドポイントコールバックがランタイムエラーをスローしたとき、または変換エラーが発生したとき、 あるいは返された `io.smallrye.mutiny.Uni`/`io.smallrye.mutiny.Multi` が失敗した場合に呼び出されます。

source: WebSocket endpoints can be secured with the xref:security-authorize-web-endpoints-reference.adoc#permission-checker[permission checkers]. We recommend to <<secure-http-upgrade>> rather than individual endpoint methods. For example:
ja_jp: WebSocket エンドポイントは、xref:security-authorize-web-endpoints-reference.adoc#permission-checker[パーミッションチェッカー] を使用して保護できます。 個々のエンドポイントメソッドではなく、<<secure-http-upgrade>> を推奨します。以下に例を示します。

source: WebSocket endpoints can define the mode used to process incoming events for a specific connection using the `@WebSocket#inboundProcessingMode()`, and `@WebSocketClient.inboundProcessingMode()` respectively. An incoming event can represent a message (text, binary, pong), opening connection and closing connection. By default, events are processed serially and ordering is guaranteed. This means that if an endpoint receives events `A` and `B` (in this particular order) then callback for event `B` will be invoked after the callback for event `A` completed. However, in some situations it is preferable to process events concurrently, i.e. with no ordering guarantees but also with no concurrency limits. For this cases, the `InboundProcessingMode#CONCURRENT` should be used.
ja_jp: WebSocket エンドポイントは、それぞれ `@WebSocket#inboundProcessingMode()` と `@WebSocketClient.inboundProcessingMode()` を使用して、特定の接続の受信イベントを処理するために使用されるモードを定義できます。 受信イベントは、メッセージ (テキスト、バイナリー、pong)、接続の開始、接続の終了を表すことができます。 デフォルトでは、イベントは順番に処理され、順序が保証されます。 つまり、エンドポイントがイベント `A` と `B` を (この特定の順序で) 受信した場合、イベント `A` のコールバックが完了した後にイベント `B` のコールバックが呼び出されます。 ただし、状況によっては、順序の保証はなく、同時実行の制限もない状態でイベントを同時に処理することが望ましい場合があります。 このような場合には、 `InboundProcessingMode#CONCURRENT` を使用する必要があります。

source: WebSocket is a low-level transport protocol, in contrast to HTTP. Message formats, routing, or processing require prior agreement between the client and server regarding message semantics.
ja_jp: WebSocket は、HTTP とは対照的に、低レベルのトランスポートプロトコルです。 メッセージの形式、ルーティング、または処理には、メッセージのセマンティクスに関するクライアントとサーバー間の事前の合意が必要です。

source: WebSocket paths configured within the application are concatenated with the root path defined by `quarkus.http.root` (which defaults to `/`). This concatenation ensures that WebSocket endpoints are appropriately positioned within the application's URL structure.
ja_jp: アプリケーション内で設定された WebSocket パスは、 `quarkus.http.root` (デフォルトは `/`) で定義されたルートパスと連結されます。 この連結により、WebSocket エンドポイントがアプリケーションの URL 構造内に適切に配置されるようになります。

source: WebSocket security model is origin-based and is not designed for the client-side authentication with headers or cookies. For example, web browsers do not enforce the Same-origin policy for the opening WebSocket handshake request. When you plan to use bearer access tokens during the opening WebSocket handshake request, we strongly recommend to follow the additional security measures listed below to minimize the security risks:
ja_jp: WebSocket セキュリティーモデルはオリジンベースであり、ヘッダーまたは Cookie を使用したクライアント側認証用に設計されていません。 たとえば、Web ブラウザーは、WebSocket ハンドシェイクリクエストの開始時に、同一オリジンポリシーを強制しません。 WebSocket ハンドシェイクリクエストの開始時に、ベアラーアクセストークンを使用する予定の場合は、セキュリティーリスクを最小限に抑えるために、以下に示す追加のセキュリティー対策に従うことを強く推奨します。

source: WebSocket support
ja_jp: WebSocket サポート

source: WebSockets Next extension reference guide
ja_jp: WebSockets Next エクステンションリファレンスガイド

source: WebSockets Next reference guide
ja_jp: WebSockets Next リファレンスガイド

source: WebSockets Next security
ja_jp: WebSockets Next セキュリティー

source: Website navigation have been refreshed and we are enabling GitHub discussions for community conversations
ja_jp: Quarkusのウェブサイトがリニューアルされ、コミュニティでの会話のためにGitHub discussions が有効化されました。

source: Website publication
ja_jp: ウェブサイト掲載

source: Website refresh
ja_jp: ウェブサイトのリニューアル

source: Website refresh and GitHub Discussions
ja_jp: ウェブサイトのリニューアルとGitHub Discussions

source: Weekly Builds
ja_jp: 週次ビルド

source: Welcome to the Quarkus World Tour.
ja_jp: Quarkus ワールドツアーへようこそ。

source: Well Known Providers
ja_jp: よく知られたプロバイダー

source: Well, a bean is a _container-managed_ object that supports a set of basic services, such as injection of dependencies, lifecycle callbacks and interceptors.
ja_jp: Beanは _コンテナーで管理された_ オブジェクトです。依存性の注入、ライフサイクルコールバック、インターセプターなどの基本的なサービスのセットをサポートしています。

source: Well, a bean is a _container-managed_ object that supports a set of basic services, such as injection of dependencies, lifecycle callbacks, and interceptors.
ja_jp: Bean は、依存性の注入、ライフサイクルコールバック、インターセプターなどの基本的なサービスのセットをサポートする _コンテナーで管理された_ オブジェクトです。

source: Well, first, we need a Kafka broker. You can follow the https://kafka.apache.org/quickstart[Apache Kafka quickstart], or use the following `docker-compose.yaml` file:
ja_jp: さて、まずはKafkaブローカーが必要です。 link:https://kafka.apache.org/quickstart[Apache Kafka のクイックスタート] に従うか、以下の `docker-compose.yaml` ファイルを使用してください:

source: Well, first, we need an AMQP broker, for example http://activemq.apache.org/components/artemis/[Apache ActiveMQ Artemis]. You can follow the http://activemq.apache.org/components/artemis/documentation/latest/using-server.html[Getting Started with Artemis] documentation, or use the following `docker-compose.yaml` file:
ja_jp: まず、AMQPブローカー、例えば link:http://activemq.apache.org/components/artemis/[Apache ActiveMQ Artemis] が必要です。 link:http://activemq.apache.org/components/artemis/documentation/latest/using-server.html[Getting Started with Artemis] のドキュメントに従うか、以下の `docker-compose.yaml` ファイルを使用してください:

source: Well, we did what any self-respecting computer scientist would do and looked at the data. What was causing this shift and stopping us from being more agile?
ja_jp: そこで私たちは、自尊心のあるコンピューターサイエンティストがするように、データを調べてみました。何がこの変化の原因であり、よりアジャイルになることを妨げているのか？

source: Well-known OIDC providers, such as GitHub, Google, Microsoft, Apple... are very widely used to authenticate users in modern applications.
ja_jp: GitHub、Google、Microsoft、Appleなどの有名なOIDCプロバイダーは、最新のアプリケーションでユーザーを認証するために非常に広く使用されています。

source: We’ll be playing some classics as well as some songs from the new releases(s).
ja_jp: 古典的な内容や新しい内容も披露する予定です。

source: We’re always looking for involvement from the community! There is always a list of https://github.com/quarkusio/quarkus-super-heroes/issues?q=is%3Aopen+is%3Aissue+label%3Aenhancement[enhancements^] and https://github.com/quarkusio/quarkus-super-heroes/issues?q=is%3Aopen+is%3Aissue+label%3Abug[bugs^] to pick from if you’re interested in getting involved.
ja_jp: 私たちは常にコミュニティからの参加を求めています。 link:https://github.com/quarkusio/quarkus-super-heroes/issues?q=is%3Aopen+is%3Aissue+label%3Aenhancement[改良, window=_blank]点や link:https://github.com/quarkusio/quarkus-super-heroes/issues?q=is%3Aopen+is%3Aissue+label%3Abug[バグ, window=_blank]のリストは常に用意されているので、興味のある方はぜひ参加してみてください。

source: We’re bringing the band back on the road to continue bringing our unique, hands-on experience with access to Quarkus experts designed to help you get started with Java in a Kubernetes world. Whether you are a Quarkus first-timer or seasoned pro, your JUG will love this show.
ja_jp: このバンドをツアーに戻し、Quarkusの専門家へのアクセスがあり、Kubernetesの世界でJavaを使い始めるのに役立つように設計された独自のハンズオン体験を引き続き提供します。Quarkusが初めての方でも、経験豊富なプロの方でも、JUGはこのショーを気に入るでしょう。

source: What Actually is Quarkus?
ja_jp: Quarkusとは何でしょうか？

source: What Are Dev Services?
ja_jp: Dev Services(開発サービス)とは何ですか？

source: What Can It Do?
ja_jp: 何ができますか?

source: What JAX-RS features are missing?
ja_jp: どのJAX-RSの機能が欠けていますか?

source: What about Apache Log4j ?
ja_jp: Apache Log4j はどうですか?

source: What about Reactive Routes?
ja_jp: リアクティブルートは?

source: What are the advantages of SSR (Server Side Rendering) over SPA (Single Page App)?
ja_jp: SPA (シングルページアプリケーション) と比較した SSR (サーバーサイドレンダリング) の利点は何ですか?

source: What are the big wins we accomplished by moving to Quarkus?
ja_jp: Quarkusへの移行によって得られた大きな成果は何ですか？

source: What are the extension statuses?
ja_jp: エクステンションステータスとは何ですか?

source: What are virtual threads ?
ja_jp: 仮想スレッドとは何ですか？

source: What are virtual threads?
ja_jp: 仮想スレッドとは？

source: What can we do about this?
ja_jp: これはどうしたらいいのでしょうか?

source: What changes for extension owners?
ja_jp: エクステンション所有者にとっての変更点

source: What changes for users?
ja_jp: ユーザーにとっての変更点

source: What constitutes a strict bearer access token or authorization code flow support can vary significantly between deployments. For example, one OIDC provider may require MTLS client authentication, another one - DPoP binding or PKCE support. There are too many combinations for us to cover in this document.
ja_jp: 何をもって厳格なベアラーアクセストークンまたは認可コードフローのサポートとするかは、デプロイメントによって大きく異なります。たとえば、ある OIDC プロバイダーは MTLS クライアント認証を必要とし、別のプロバイダーは DPoP バインディングや PKCE サポートを必要とする場合があります。組み合わせが多すぎるため、このドキュメントですべてをカバーすることはできません。

source: What do Java and taxes have in common? Java, specifically Quarkus, is the backbone of a new and innovative tax solution developed by https://www.abraxas.ch/de[Abraxas Informatik AG] that is targeted to Swiss government tax agencies. Quarkus made developing the Java-based tax application exciting and innovative for the development team.
ja_jp: Javaと税金の共通点とは？Java、特にQuarkusは、 link:https://www.abraxas.ch/de[Abraxas Informatik AG]が開発したスイス政府の税務機関を対象とした新しく革新的な税務ソリューションのバックボーンとなっています。Quarkusによって、Javaベースの税務アプリケーションの開発は、開発チームにとってエキサイティングで革新的なものになりました。

source: What does Stork bring for Kubernetes?
ja_jp: StorkはKubernetesに何をもたらしますか？

source: What does a bean look like?
ja_jp: Beanはどんな形をしているのでしょうか?

source: What does having a working C developer environment mean?
ja_jp: 動作するC言語の開発環境があるとはどういう意味でしょうか?

source: What does it mean to be a Kubernetes-native framework?
ja_jp: Kubernetesネイティブなフレームワークとはどういうことでしょうか？

source: What does that change for you?
ja_jp: それによって何が変わるのでしょうか？

source: What else for the developers
ja_jp: その他開発者向け情報

source: What extensions are in Quarkiverse already?
ja_jp: すでにQuarkiverseにはどのようなエクステンションがあるのでしょうか?

source: What follows is a brief summary of the different document types, but their site is worth a read if you want to understand more of the reasoning behind this classification.
ja_jp: 以下は、文書の種類を簡単にまとめたものですが、この分類の理由をもっと理解したい方は、彼らのサイトを一読する価値があります。

source: What happens if an extension transforms a user class using `BytecodeTransformerBuildItem`, and replaces `@jakarta.annotation.Resource` with `@jakarta.inject.Inject`? The field will not be injected by Arc. Debugging will show the transformed class being loaded in the app, but it looks like Arc doesn't see the new code.
ja_jp: エクステンションが `BytecodeTransformerBuildItem` を使用してユーザークラスを変換し、 `@jakarta.annotation.Resource` を `@jakarta.inject.Inject` に置き換えるとどうなりますか? フィールドは Arc によって挿入されません。 デバッグでは、変換されたクラスがアプリケーションにロードされていることが表示されますが、Arc では新しいコードが認識されないようです。

source: What happens when the build time principle and the reactive core are combined?
ja_jp: ビルド時原則とリアクティブコアが結合されるとどうなるでしょうか？

source: What if I Need to Know All the Scopes Used in the Application?
ja_jp: アプリケーションで使用されているすべてのスコープを知る必要がある場合はどうなりますか?

source: What if you'd rather use an external database that you manage yourself? Add the following to `src/main/resources/application.properties`:
ja_jp: 自分で管理する外部データベースを使用する場合はどうすればよいですか? 以下を `src/main/resources/application.properties` 追加します。

source: What information helps most debug issues that happen either at build-time or run-time?
ja_jp: ビルド時または実行時に発生するほとんどの問題のデバッグに役立つ情報は何ですか?

source: What is Application Class Data Sharing (AppCDS)?
ja_jp: アプリケーションクラスデータ共有（AppCDS）とは？

source: What is Cloud Event?
ja_jp: クラウドイベントとは?

source: What is Dev UI?
ja_jp: Dev UI とは？

source: What is Project Leyden?
ja_jp: Project Leyden とは？

source: What is Quarkus
ja_jp: Quarkus とは

source: What is Quarkus REST?
ja_jp: Quarkus RESTとは何ですか？

source: What is Quarkus?
ja_jp: Quarkusとは何か?

source: What is RESTEasy Reactive?
ja_jp: RESTEasy Reactiveとは？

source: What is SnapStart?
ja_jp: SnapStartとは？

source: What is Stork?
ja_jp: Storkとは？

source: What is _Reactive_?
ja_jp: _リアクティブ_ とは？

source: What is a Quarkus extension?
ja_jp: Quarkusエクステンションとは何ですか?

source: What is a plugin
ja_jp: プラグインとは

source: What is augmentation?
ja_jp: オーグメンテーションとは？

source: What is currently unsupported
ja_jp: 現在サポートされていない機能

source: What is it good for?
ja_jp: 何に使うと適切ですか?

source: What is it?
ja_jp: それは何ですか?

source: What is supported
ja_jp: サポートされている内容

source: What is the Quarkus Platform?
ja_jp: Quarkusプラットフォームとは

source: What is the difference from `@Initialized(ApplicationScoped.class)` and `@Destroyed(ApplicationScoped.class)`
ja_jp: `@Initialized(ApplicationScoped.class)` と `@Destroyed(ApplicationScoped.class)` との違いは?

source: What is the performance implication of using @Blocking?
ja_jp: @Blocking を使用することによるパフォーマンスへの影響について

source: What is the relevance of startup and shutdown events for extension authors? We have already seen the use of a `ShutdownContext` to register a callback to perform shutdown tasks in the <<Starting a Service>> section. These shutdown tasks would be called after a `ShutdownEvent` had been sent.
ja_jp: エクステンションの作成者にとって、起動イベントとシャットダウンイベントは何が関連しているでしょうか。 `ShutdownContext` を使用してコールバックを登録し、シャットダウンタスクを実行する方法については、<<サービスの開始>> セクションで確認しました。これらのシャットダウンタスクは、 `ShutdownEvent` が送信された後に呼び出されます。

source: What is the relevance of startup and shutdown events for extension authors? We have already seen the use of a `ShutdownContext` to register a callback to perform shutdown tasks in the <<starting-service>> section. These shutdown tasks would be called after a `ShutdownEvent` had been sent.
ja_jp: エクステンションの作成者にとって、起動イベントとシャットダウンイベントは何が関連しているでしょうか。 `ShutdownContext` を使用して コールバックを登録し、シャットダウンタスクを実行する方法については、<<starting-service>> セクションですでに確認しました。 これらのシャットダウンタスクは、 `ShutdownEvent` が送信された後に呼び出されます。

source: What is your license?
ja_jp: ライセンスは何ですか?
